Revit 2024 API
ElementMulticlassFilter Constructor
Overload List
Name | Description
ElementMulticlassFilter(IList<Type>)
 Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes.
ElementMulticlassFilter(IList<Type>, Boolean)
 Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes, with an option to instead match elements whose Element subclass does not match the list of input classes.
See Also
ElementMulticlassFilter Class
ElementMulticlassFilter Members
Autodesk.Revit.DB Namespace